Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipshipyard</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.this["hsanjuan"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "hsanjuan"
    }

  # github_repository_collaborator.this["waterworks-infra:hsanjuan"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "waterworks-infra"
      + username                    = "hsanjuan"
    }

  # github_team_membership.this["engineering:hsanjuan"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "10925582"
      + username = "hsanjuan"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Commentplan -->